{"class_name": "Model", "config": {"name": "squeezenet", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 227, 227, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "relu_conv1", "class_name": "Activation", "config": {"name": "relu_conv1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["relu_conv1", 0, 0, {}]]]}, {"name": "fire2_squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire2_squeeze1x1", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "fire2_relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire2_relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire2_squeeze1x1", 0, 0, {}]]]}, {"name": "fire2_expand1x1", "class_name": "Conv2D", "config": {"name": "fire2_expand1x1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire2_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire2_expand3x3", "class_name": "Conv2D", "config": {"name": "fire2_expand3x3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire2_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire2_relu_expand1x1", "class_name": "Activation", "config": {"name": "fire2_relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire2_expand1x1", 0, 0, {}]]]}, {"name": "fire2_relu_expand3x3", "class_name": "Activation", "config": {"name": "fire2_relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire2_expand3x3", 0, 0, {}]]]}, {"name": "fire2_concat", "class_name": "Concatenate", "config": {"name": "fire2_concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire2_relu_expand1x1", 0, 0, {}], ["fire2_relu_expand3x3", 0, 0, {}]]]}, {"name": "fire3_squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire3_squeeze1x1", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire2_concat", 0, 0, {}]]]}, {"name": "fire3_relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire3_relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire3_squeeze1x1", 0, 0, {}]]]}, {"name": "fire3_expand1x1", "class_name": "Conv2D", "config": {"name": "fire3_expand1x1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire3_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire3_expand3x3", "class_name": "Conv2D", "config": {"name": "fire3_expand3x3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire3_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire3_relu_expand1x1", "class_name": "Activation", "config": {"name": "fire3_relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire3_expand1x1", 0, 0, {}]]]}, {"name": "fire3_relu_expand3x3", "class_name": "Activation", "config": {"name": "fire3_relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire3_expand3x3", 0, 0, {}]]]}, {"name": "fire3_concat", "class_name": "Concatenate", "config": {"name": "fire3_concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire3_relu_expand1x1", 0, 0, {}], ["fire3_relu_expand3x3", 0, 0, {}]]]}, {"name": "pool3", "class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["fire3_concat", 0, 0, {}]]]}, {"name": "fire4_squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire4_squeeze1x1", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"name": "fire4_relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire4_relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire4_squeeze1x1", 0, 0, {}]]]}, {"name": "fire4_expand1x1", "class_name": "Conv2D", "config": {"name": "fire4_expand1x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire4_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire4_expand3x3", "class_name": "Conv2D", "config": {"name": "fire4_expand3x3", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire4_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire4_relu_expand1x1", "class_name": "Activation", "config": {"name": "fire4_relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire4_expand1x1", 0, 0, {}]]]}, {"name": "fire4_relu_expand3x3", "class_name": "Activation", "config": {"name": "fire4_relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire4_expand3x3", 0, 0, {}]]]}, {"name": "fire4_concat", "class_name": "Concatenate", "config": {"name": "fire4_concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire4_relu_expand1x1", 0, 0, {}], ["fire4_relu_expand3x3", 0, 0, {}]]]}, {"name": "fire5_squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire5_squeeze1x1", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire4_concat", 0, 0, {}]]]}, {"name": "fire5_relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire5_relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire5_squeeze1x1", 0, 0, {}]]]}, {"name": "fire5_expand1x1", "class_name": "Conv2D", "config": {"name": "fire5_expand1x1", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire5_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire5_expand3x3", "class_name": "Conv2D", "config": {"name": "fire5_expand3x3", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire5_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire5_relu_expand1x1", "class_name": "Activation", "config": {"name": "fire5_relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire5_expand1x1", 0, 0, {}]]]}, {"name": "fire5_relu_expand3x3", "class_name": "Activation", "config": {"name": "fire5_relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire5_expand3x3", 0, 0, {}]]]}, {"name": "fire5_concat", "class_name": "Concatenate", "config": {"name": "fire5_concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire5_relu_expand1x1", 0, 0, {}], ["fire5_relu_expand3x3", 0, 0, {}]]]}, {"name": "pool5", "class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["fire5_concat", 0, 0, {}]]]}, {"name": "fire6_squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire6_squeeze1x1", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool5", 0, 0, {}]]]}, {"name": "fire6_relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire6_relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire6_squeeze1x1", 0, 0, {}]]]}, {"name": "fire6_expand1x1", "class_name": "Conv2D", "config": {"name": "fire6_expand1x1", "trainable": true, "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire6_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire6_expand3x3", "class_name": "Conv2D", "config": {"name": "fire6_expand3x3", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire6_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire6_relu_expand1x1", "class_name": "Activation", "config": {"name": "fire6_relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire6_expand1x1", 0, 0, {}]]]}, {"name": "fire6_relu_expand3x3", "class_name": "Activation", "config": {"name": "fire6_relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire6_expand3x3", 0, 0, {}]]]}, {"name": "fire6_concat", "class_name": "Concatenate", "config": {"name": "fire6_concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire6_relu_expand1x1", 0, 0, {}], ["fire6_relu_expand3x3", 0, 0, {}]]]}, {"name": "fire7_squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire7_squeeze1x1", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire6_concat", 0, 0, {}]]]}, {"name": "fire7_relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire7_relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire7_squeeze1x1", 0, 0, {}]]]}, {"name": "fire7_expand1x1", "class_name": "Conv2D", "config": {"name": "fire7_expand1x1", "trainable": true, "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire7_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire7_expand3x3", "class_name": "Conv2D", "config": {"name": "fire7_expand3x3", "trainable": true, "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire7_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire7_relu_expand1x1", "class_name": "Activation", "config": {"name": "fire7_relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire7_expand1x1", 0, 0, {}]]]}, {"name": "fire7_relu_expand3x3", "class_name": "Activation", "config": {"name": "fire7_relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire7_expand3x3", 0, 0, {}]]]}, {"name": "fire7_concat", "class_name": "Concatenate", "config": {"name": "fire7_concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire7_relu_expand1x1", 0, 0, {}], ["fire7_relu_expand3x3", 0, 0, {}]]]}, {"name": "fire8_squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire8_squeeze1x1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire7_concat", 0, 0, {}]]]}, {"name": "fire8_relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire8_relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire8_squeeze1x1", 0, 0, {}]]]}, {"name": "fire8_expand1x1", "class_name": "Conv2D", "config": {"name": "fire8_expand1x1", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire8_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire8_expand3x3", "class_name": "Conv2D", "config": {"name": "fire8_expand3x3", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire8_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire8_relu_expand1x1", "class_name": "Activation", "config": {"name": "fire8_relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire8_expand1x1", 0, 0, {}]]]}, {"name": "fire8_relu_expand3x3", "class_name": "Activation", "config": {"name": "fire8_relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire8_expand3x3", 0, 0, {}]]]}, {"name": "fire8_concat", "class_name": "Concatenate", "config": {"name": "fire8_concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire8_relu_expand1x1", 0, 0, {}], ["fire8_relu_expand3x3", 0, 0, {}]]]}, {"name": "fire9_squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire9_squeeze1x1", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire8_concat", 0, 0, {}]]]}, {"name": "fire9_relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire9_relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire9_squeeze1x1", 0, 0, {}]]]}, {"name": "fire9_expand1x1", "class_name": "Conv2D", "config": {"name": "fire9_expand1x1", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire9_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire9_expand3x3", "class_name": "Conv2D", "config": {"name": "fire9_expand3x3", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire9_relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire9_relu_expand1x1", "class_name": "Activation", "config": {"name": "fire9_relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire9_expand1x1", 0, 0, {}]]]}, {"name": "fire9_relu_expand3x3", "class_name": "Activation", "config": {"name": "fire9_relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire9_expand3x3", 0, 0, {}]]]}, {"name": "fire9_concat", "class_name": "Concatenate", "config": {"name": "fire9_concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire9_relu_expand1x1", 0, 0, {}], ["fire9_relu_expand3x3", 0, 0, {}]]]}, {"name": "drop9", "class_name": "Dropout", "config": {"name": "drop9", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["fire9_concat", 0, 0, {}]]]}, {"name": "conv10", "class_name": "Conv2D", "config": {"name": "conv10", "trainable": true, "filters": 1000, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop9", 0, 0, {}]]]}, {"name": "relu_conv10", "class_name": "Activation", "config": {"name": "relu_conv10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv10", 0, 0, {}]]]}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["relu_conv10", 0, 0, {}]]]}, {"name": "loss", "class_name": "Activation", "config": {"name": "loss", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["loss", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}